
&НаКлиенте
Процедура ПолучениеСпискаНовыхКонтактныхЛиц(Команда)
	ПолучениеСпискаНовыхКонтактныхЛицНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаНовыхКонтактныхЛицНаСервере()
Результат = мм_ОбменЛичныйКабинет.ПолучениеСпискаНовыхКонтактныхЛиц();
КонецПроцедуры  


&НаКлиенте
Процедура ПроверкаСостоянияКонтактногоЛица(Команда)  
	ContactID = "3e3c5d81-5a91-11ec-a0c7-861cc626592c";
	ПроверкаСостоянияКонтактногоЛицаНаСервере(ContactID);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПроверкаСостоянияКонтактногоЛицаНаСервере(ContactID)
	
	Результат = мм_ОбменЛичныйКабинет.ПроверкаСостоянияКонтактногоЛица(ContactID);
	
КонецПроцедуры


&НаКлиенте
Процедура СозданиеКонтактногоЛица(Команда)
	СозданиеКонтактногоЛицаНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СозданиеКонтактногоЛицаНаСервере()        
	
	createContact = Новый Структура;
	createContact.Вставить("CurrentContactID", "3e3c5d81-5a91-11ec-a0c7-861cc626592c");    
	createContact.Вставить("CustomerID", "714ab055-cded-11e2-8029-0015e9b8c48d");
	createContact.Вставить("NewContactName", "Сидоров Прохор Феклович");
	createContact.Вставить("NewContactEmail", "supertest@test.ru");
	createContact.Вставить("NewContactPhone", "111-33-578");
	createContact.Вставить("NewContactIsCurator", Ложь);
	
	Результат = мм_ОбменЛичныйКабинет.СозданиеКонтактногоЛица(createContact);
КонецПроцедуры   

&НаКлиенте
Процедура УдалениеКонтактногоЛица(Команда)
	УдалениеКонтактногоЛицаНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УдалениеКонтактногоЛицаНаСервере()

	
	removeContact = Новый Структура;
	removeContact.Вставить("CurrentContactID", "3e3c5d81-5a91-11ec-a0c7-861cc626592c");    
	removeContact.Вставить("CustomerID", "714ab055-cded-11e2-8029-0015e9b8c48d");
	removeContact.Вставить("RemoveContactID", "59e7dfe0-5b37-11ec-8c07-04d9f58bf70bч"); 
	
	мм_ОбменЛичныйКабинет.УдалениеКонтактногоЛица(removeContact);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДоговоров(Команда)
	ПолучениеДоговоровНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучениеДоговоровНаСервере()
	IDEnter = Новый Структура;
	IDEnter.Вставить("ContactID", "3e3c5d81-5a91-11ec-a0c7-861cc626592c");
	
	мм_ОбменЛичныйКабинет.ПолучениеСпискаДоговоровКонтрагентовПользователяЛК("3e3c5d81-5a91-11ec-a0c7-861cc626592c");
КонецПроцедуры



// //////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ПолучениеИДПользователя(Команда)
	ПолучениеИДПользователяНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПолучениеИДПользователяНаСервере()
	
	Контрагент = Справочники.мм_ПользователиЛичныйКабинет.НайтиПоНаименованию("Сидоров Прохор Феклович").Ссылка.УникальныйИдентификатор(); 
	//Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Бакалея").Ссылка.УникальныйИдентификатор();
	Сообщить(Контрагент);
	
КонецПроцедуры




